{
    "points": [
        { "no": 1, "location": "kishkindha", "topic": "Hanumān meets Jambavan, Sugrīva", "content": "Jāmbavān, with heartfelt consideration, fervently spurred on and inspired Hanuman to unlock his dormant power and vigor to accomplish the daunting feat of traversing the ocean. Māruti, also known as Hanuman, began his quest to discover the celestial pathways traversed by divine beings in the heavens. Hanuman bore the sole responsibility of undertaking the seemingly impossible task of crossing the ocean." },
        { "no": 2, "location": "mahendramountain", "topic": "Hanumān's Determined Quest for Sīta Devī", "content": "Hanumān's powerful leap caused chaos, startling animals, snakes, and even sages who feared a mountain collapse. Vidyādharas fled in fear, while sages explained Hanumān's quest for Sīta Devī, vital for Rāma's success. Vowing to find Sīta in Rāvaņa's Lańkā or even heaven, Hanumān promised to return with Rāvaņa as a prisoner or uproot Lańkā itself. Sharing his oath with Jambavan and Sugriya, his shadow stretched thirty yojanas long and ten wide." },
        { "no": 3, "location": "indianocean", "topic": "Hanuman's Encounter with Mainaka Mountain in the Ramayana.", "content": "King Daśaratha sought aid for Hanumān from sea king Sāgara, who advised resting on the Maināka Mountain. Hanumān, refusing hospitality despite Maināka's debt to his father Vāyu deva, pressed on, citing his commitment to Rāma's mission. Maināka blessed Hanumān as he continued his journey, praised by gods, while Maināka remained standing on the sea forever." },
        { "no": 4, "location": "indianocean","topic":"Hanumān's Encounter with Surasa and Fearless Flight on Divine Paths", "content":"Hanumān faced Surasa, who blocked his path, demanding he enter her mouth. He persuaded her with his mission to find Sīta, then cleverly minimized himself to a thumb's size to fulfill her demand. Afterward, he resumed his normal form and informed Surasa of his feat before continuing his journey. Hanumān proceeded along the path of gods and celestial beings, fearlessly flying towards his goal, witnessed by stars, moon, and sun."},
        { "no": 5, "location": "indianocean","topic":"Hanumān's Confrontation with Simhika and Divine Blessings","content":"Hanumān faced the shape-shifting demon Simhika, who targeted his shadow to devour it. Sensing his speed hindered, he swiftly entered her mouth, extracted her heart, and defeated her before she could react. Siddhas, Cāraņas, and Gandharvas blessed Hanumān for slaying the dangerous sea demon, ensuring his continued success on his mission."},
        { "no": 6, "location": "100yojanas","topic":"Hanumān's Discovery of Lańkā", "content": "After defeating Simhika, Hanumān resumed his flight and spotted land within a hundred yojanas. He surveyed the shores and found a spot with diverse trees. Shrinking to a smaller size, resembling Vāmana, he climbed Lambā Mountain and beheld Lańkā shining brilliantly on Trikuta Mountain, akin to Amarāvathi in the heavens."},
        { "no": 7, "location": "lambaparvat", "topic": "Hanumān's Stealthy Approach to Lańkā from Lamba Mountain", "content": "Hanumān beheld Lańkā's grandeur but pondered its formidable defenses. He strategized to enter unseen, waiting for darkness to conceal him. Recognizing the importance of diplomacy, he planned to avoid agitating Rāvaņa while finding Sīta. Patiently waiting for sunset, he shrank in size and leaped into the city. Under moonlight, he marveled at Lańkā's beauty, resembling Kubera’s Alakā city and Indra’s city combined."},
        { "no": 8, "location": "lankaentrance", "topic": "Hanuman's Encounter with Lankhini at the Gates of Lanka", "content": "At the gates of Lanka, Hanuman was confronted by Lankhini, the city's guardian demoness. After a brief fight, Hanuman defeated her, and she recognized him as the monkey prophesied to bring about Ravana's downfall. Lankhini granted him entry, and Hanuman stealthily entered Lanka, searching for Sita and gathering intelligence."},
        { "no": 9, "location": "lankapalace", "topic": "Hanumān's Exploration of Rāvaņa's Palace", "content": "Hanumān quietly enters Rāvaņa's heavily guarded palace, marveling at its opulence and the presence of sophisticated air vehicles. Despite the grandeur, Sīta is nowhere to be found, sparking concern. He discovers the Pușpaka Vimāna, an extraordinary air vehicle adorned with precious gems and gold, surpassing even temple marvels. Hanumān explores its luxurious interiors, amazed by its opulence and elegant features."},
        { "no": 10, "location": "lankapalace", "topic": "Hanumān's Search in Rāvaņa's Palace", "content": "Hanumān explores Rāvaņa's palace, mistaking Mandodari for Sīta due to their resemblance. Despite his error, he persists in searching for Sīta but cannot find her. Overwhelmed with despair, he prays for strength and remains determined to continue his quest. Hanumān acknowledges the challenges ahead as he heads to the Aśoka garden, committed to finding Sīta."},
        { "no": 11, "location": "simsupatree", "topic": "Hanumān's Discovery of Sīta Devī and Her Unwavering Devotion", "content": "Hanumān waits atop a Śimśupa tree, anticipating Sīta Devī's arrival, and eventually discovers her amidst demons in the Aśoka garden. Despite her weakened state, her beauty shines through, matching Śri Rāma's descriptions. Witnessing Rāvaņa's attempts to sway Sīta with promises and threats, she remains steadfast in her devotion to Śri Rāma, rejecting Rāvaņa's advances with resolute determination and fierce words. Sīta's unwavering commitment to her husband stands strong amid adversities in Rāvaņa's captivity."},
        { "no": 12, "location": "simsupatree", "topic": "Trijața's Prophecy of Rāma's Victory and Sīta's Forgiveness", "content": "Trijața, an elderly demon, intervenes as others threaten Sīta, sharing a vivid dream foretelling Rāma's imminent victory and Rāvaņa's downfall. She witnesses symbolic scenes of Rāma, Lakșmaņa, and Sīta riding a celestial chariot over Lańkā, followed by Rāvaņa's humiliating fate. Trijața predicts Vibhīșaņa's crowning and warns of impending doom, urging demons to seek Sīta's forgiveness and Rāma's protection to avoid destruction. Her prophecy emphasizes the importance of reconciliation and forgiveness for safety from Rāma's wrath."},
        { "no": 13, "location": "simsupatree", "topic": "Hanuman Finds Sita under the Simsupa Tree", "content": "Near the Simsupa tree, Hanuman found a sorrowful Sita guarded by demonesses. He consoled her by chanting Rama's story and presenting his ring. Sita, filled with hope, entrusted Hanuman with her Chudamani for Rama. Despite Hanuman's offer to take her, Sita insisted on Rama rescuing her with honor."},
        { "no": 14, "location": "ashokavatika", "topic": "Hanumān's Uproar and Fierce Battles in the Aśoka Garden", "content": "Hanumān provokes chaos by destroying the Aśoka garden, initiating a series of fierce battles against Rāvaņa's warriors. He defeats the Kinkaras, Jambumālini, and Rāvaņa's seven sons before engaging five skilled commanders. Hanumān strategically defeats each opponent, including Rāvaņa's son Akșa Kumāra, showcasing his strength and agility. Witnessed by celestial beings, Hanumān's battles demonstrate his determination to fulfill his mission."},
        { "no": 15, "location": "ravanacourt", "topic": "Hanumān's Confrontation and Escape from Rāvaņa's Court", "content": "Hanumān feigns exhaustion to meet Rāvaņa, delivering a message about Sīta's unlawful capture. Despite Hanumān's warnings of Śri Rāma's power, Rāvaņa orders his execution, igniting Hanumān's tail. Protected by Śri Rāma's blessings, Hanumān escapes and observes Lańkā's layout. He then causes chaos by setting fire to buildings, fulfilling his mission before returning to Śri Rāma."},
        { "no": 16, "location": "lanka", "topic": "Hanumān's Remorse and Reflection", "content": "After burning Lańkā, Hanumān feels remorse for his impulsive actions and contemplates ending his life. He realizes Sīta Māta's divine nature would protect her and learns the importance of controlling anger for intelligent decision-making. Hanumān reflects on his faults and emphasizes the need for clarity in actions."},
        { "no": 17, "location": "ashokavatika", "topic": "Hanumān's Discovery of Sīta Devī's Safety", "content": "Despite his regret, Hanumān received the surprising news that Sīta Devī remained unharmed under the Aśoka tree amidst the burned city. Relieved by this revelation, he decided to seek Sīta Māta's blessings before his departure."},
        { "no": 18, "location": "aristamountain", "topic": "Hanumān's Farewell to Sīta Devī", "content": "Hanumān assures Sīta of Śri Rāma's imminent rescue before departing. He ascends Arista Mountain, admires its beauty, and enlarges to cross the ocean, beginning his return journey to Śri Rāma."},
        { "no": 19, "location": "indianocean","topic":"Hanumān's Celestial Journey","content":"Hanumān's swift flight through the sky, encountering celestial phenomena in unique forms, fills the monkey army with initial anxiety, later turning to joy as they recognize his confident roar."},
        { "no": 20, "location": "mahendramountain", "topic": "Hanumān's Return and Plans for Sīta's Rescue", "content": "Upon his return, Hanumān shares Sīta Māta's distress in Lańkā, filling the monkeys with joy at her safety. Ańgadā praises Hanumān's valor, and together with Jāmbavān, they discuss plans for Sīta's rescue. Hanumān emphasizes her unwavering loyalty to Śri Rāma and the weakening of Rāvaņa's strength due to imprisoning her. While eager to embark on the mission, caution is advised, respecting Śri Rāma's wishes." },
        { "no": 21, "location": "madhuvan", "topic": "The Monkeys' Drunken Revelry in Madhuvana", "content": "Returning from Lanka, Hanuman and the monkeys stopped at Madhuvana, a garden known for its intoxicating honey wine. Overindulging in celebration, the monkeys became drunk and wreaked havoc, destroying plants and attacking guards. Sugriva, recognizing their revelry as a sign of Hanuman's success, sent for them and learned of Sita's whereabouts."},
        { "no": 22, "location": "kishkindha" , "topic": "Hanuman's Report and Sita's Message", "content": "The monkeys celebrate Hanuman's return and success. Hanuman presents the Chudamani to Rama and recounts Sita's message."},
        { "no": 23, "location": "ayodhya" , "topic": "Rama Returns and Becomes King", "content": "Hanuman travels to Ayodhya and informs Bharata of Rama's victory and imminent return. Bharata prepares for Rama's arrival and the joyous coronation ceremony. Rama returns to Ayodhya and is crowned king, ushering in an era of peace and prosperity."}
    ]
}