[
    {
        "name":"Prior Context and the Origins of the Universe",
        "image":"../images/stories/Universe.jpeg",
        "about":"Lord Brahma initially formed the universe then formed water for the universe.He created 2 entities: Rakshasa (demons) (to protect it) and Yaksha (to pray it).In rakshasas (demons) there were 2 prominent and powerful brothers-> Heti and Praheti.while Praheti went to follow the path of dharma and went for meditation, Heti married Kaal’s sister Bhaya.They then had a son named Vidyut Kesha who married Balakantaka.Eventually the 2 had a baby but they left him unattended in a forest and due to some reasons completely forgot about him. Luckily for the baby at that time lord Shiva and Parvati were travelling via Pushpak Vimaan (an aircraft) and maa Parvati saw the baby  crying.This made her heart melt due to which lord shiva gave him the boon to be eternal.Also maa parvati gave boon to all the female rakshasa (demons) that their son’s will immediately become teenagers from now on. Due to this boon the rakshas became overpopulated. Also the baby that was given the boon to be eternal was named Sukesh. Sukesh eventually married Devvati and had 3 sons Malyavan,Mali and Sumali who married Sundari,Ketumati ad Vasudha respectively.After knowing about their father,they too praised lord brahma for years and eventually got the boon to become extremely powerful.They tortured not only devas (angels) but rakshasas (demons) as well.They went to god Vishwamitra and forcefully took the Lanka from him(asking him to build something similar as Devlok palace for the rakshasas as well).They also tried settling with other rakshas and grew stronger families within them and become so strong that their terror grew immensely.Due to this both devas and rakshasas went to lord Brahma for help who had to unfortunately refused their request since it was him who gave the boon at the first place.So they then went to lord Vishnu and he said yes to their request.When the brothers heard about it  they immediately went to attack the Devlok but found lord Vishnu in their path.An intense battle occurred but eventually Mali and Malyavan were killed through lord Vishnu’s Sudarshana chakra.Seeing this Sumali went to hide in patal lok for some time with his remaining family from the battle. At this point Lanka was taken back from the rakshasas (demons) and given to lord Kuber.Sumali had a daughter named Kaiksi .Looking at Kuber being so great at everything, he told Kaiksi to marry Rishi Pulatsa’s son Rishi Vishwa(Kuber’s father) and get children of her own so that they too will be powerful in future and will help getting rakshasa’s (demon’s) dominance back.Kaiksi obediently does what her father told but lord Vishwa knew the purpose she came up to him just by looking at her.He told Kaiksi that I will give you my babies,but remember due to the bad intentions you cam up with,they will all be of your kid(rakshasas).Hearing this Kaiksi begs him after which he says that our youngest child will be of my kind(Vibhishana). This is how the origin of the 4 siblings occur Dashgriva(later named as Ravana by lord Shiva himself),Kumbhakaran,Shurpanakha and Vibhishana(notice the last one is of humankind). Kaiksi then tells her sons to go and do tapasya to become even more powerful than their cousin Kuber."
    },
    {
        "name":"The Happenings in Ayodhya",
        "image":"../images/stories/Sadayodhya.jpeg",
        "about":"Due to all the features and personality of lord Rama everyone suggested to make lord Rama the king of Ayodhya.Dasaratha readily agrees and starts the preparation. But during the process he forgot to call Kakei Naresh and mithila pati Janak in rush(it is believed that it was the doing of devatas (angels) since if  they were invited, Lord Rama would have never gone to exile and hence Ravana wouldn’t have had been defeated).In all the preparation maa Kaushalya being happy gifted all his dasi’s gifts. Manthara(dasi of maa Kakei) saw this and filled maa Kakei’s heart with poison and bad omen’s telling if lord Rama becomes the king Kaushalya maa will become more favourite to king Dasharatha and all her fame would be gone.Along with that her son Bharatha will have no great significance and history and will be powerless.After Kakei got jealous and afraid of this(before she was extremely happy and proud),she went to lord Dasaratha  and reminded him of the 2 boons lord Dashratha offered when Kakei fought with lord Dasharatha in a war side by side ad also saved his life.In her 2 boons she uses first boon to make Bharatha as the king of Ayodhya rather than Rama and in her second boon she asks Dasharatha to send lord Rama for 14 years of exile.Every one was completely shocked by this  and hated Kakei to the maximum extent.Lakshmana eve suggested lord Rama to say no to this and being the oldest claim the throne himself. But we call our lord Ram “Maryadapuroshottam for a reason!He refused this and said Dharma is above everything!”Incase of Dasaratha himself was about to refuse Kakei’s demand of the boons but it was lord Rama  only who said one cannot break his dharma and by doing this lord Dashratha would be breaking the dharma being followed by the kshatriyas from ages.Hence The entire Ayodhya was drowning in sorrowness and for almost all the years of during lord Rama’s exile the city felt as if it was dead from within.This incident also depleted the health of king Dasaratha drastically.He remembered his early incident during his youth age of Shravan Kumar( another reference story) reminding him he too was cursed that he will die because of the loss of his son. He died that night making it even more saddening for the entire ayodhya.Meanwhile  prior to the death of king Dashratha ,Bharatha and Shatrughana weren't told of the lord Rama’s exile.But after Dasaratha's death they were called from Kakei Nagri.After being called they were told everything.Bharata was extremely angry with his mother and even called her the greediest person ever and made her realise what a terrible mistake she has made!Shatrughan catches Manthara who was the root cause of all this and want to take her life away to give justice to their brother lord rama but Bharatha told him if we do so our elder brother would ever forgive us and may never even come back.Also Bharatha plans to go and bring his brother back and make everything back to normal and repairing the mistakes made and also tell them about the loss of their father."
    },
    {
        "name":"The Story of Shravana Kumar",
        "image":"../images/stories/Shravankumar.jpeg",
        "about":"Shravan Kumar was a legendary figure known for his devotion to his parents. He was born to Gyanvanti (mother) and Shantanu (father). Both of them were blind hermits. Shravan took it upon himself to become their caregiver and provider. Shravan’s parents wished to visit Chardham. He was poor so he decided to carry his parents on a wooden palanquin to the pilgrim. He would ensure they were comfortable.One day, while carrying his parents to a pilgrimage site. Prince Dasharatha was out hunting in the forest of Ayodhya when he heard a sound near a lake. He shot an arrow (Shabdbhedi Baan) hoping to hit an animal but found that he had accidentally struck a teenage boy named Shravana who was carrying his sick and elderly parents on a sling. He came to the lake to collect water. With his dying breath, Shravana requested Dasharatha to take water to his parents and inform them of what happened.Shravana passed away due to his injuries, and when Dasharatha delivered the water and the news of his tragic mistake. Shravan’s parents could not bear the shock and died of grief. Despite acknowledging that it was an accident, they cursed Dasharatha with “Putrashoka,” which means grief due to the loss of a son. This curse came true when Dasharatha died without seeing his beloved son Rama, who was exiled at the order of his step-mother Queen Kaikeyi.The story highlights the tragic consequences of hasty actions and the importance of being mindful of one’s actions to avoid causing harm to others. It also illustrates the devastating impact of grief and loss on parents who have lost a child."
    },
    {
        "name":"The Miraculaous Feast at Muni Bhardwaj's Ashram",
        "image":"../images/stories/Bhardwaj.jpeg",
        "about":"When the entire army of Bahrata came to rest at Muni Bhardwaj's ashram after a long journey to get lord Rama back to Ayodhya,muni Bhardwaj after meeting Bharata and Shatrughana told them that he will be hosting a feast for them and will be serving them with the best of the food and drinks he has. But the problem was that he had only one cow named Kamdhenu who was the only source of food and drinks for the entire ashram. He was worried about how he will be able to feed the entire army with just one cow. But then he remembered that he had a son named Shringi who was a great sage and had the power to create anything he wanted. He went to his son and asked him to create food and drinks for the entire army. Shringi agreed and created a feast for the entire army. The feast was so delicious that the entire army was amazed by the taste of the food and drinks. They all praised Muni Bhardwaj and his son Shringi for the delicious feast. Muni Bhardwaj was very happy to see the army enjoying the feast and thanked his son Shringi for creating such a delicious feast for the army. The feast was so delicious that the entire army was amazed by the taste of the food and drinks. They all praised Muni Bhardwaj and his son Shringi for the delicious feast. Muni Bhardwaj was very happy to see the army enjoying the feast and thanked his son Shringi for creating such a delicious feast for the army."
    },
    {
        "name":"Origins of Pinaka and Sharanga (Bows of Lord Shiva and Lord Vishnu)",
        "image":"../images/stories/Bow.jpeg",
        "about":"The Sharanga is notable for its employment by a number of the Dashavatara, the avatars of Vishnu: Parashurama, Rama, and Krishna.[5] Rama carries the bow in his epic and is also mentioned to bear it in the Padma Purana.[6] The bow is offered to him by Parashurama, the previous incarnation of Vishnu. In the Ramayana, Parashurama, the Brahmin warrior who is famously the scourge of Kshatriyas, regales the tale of the bow. Vishvakarma creates the bows of Pinaka and Sharanga to settle the question of the superiority of the deities Vishnu and Shiva. Vishnu is victorious, and Shiva presents his bow to the king of Mithila. Vishnu's bow is passed down to Richika, who presented it to Jamadagni, Parashurama's father, the latter claiming it after his father's assassination. Parashurama challenges Rama to fight him if the latter is able to string the bow. When the prince achieves this, the warrior admits defeat and retires to his abode.In a legend also featured in the Padma Purana, a number of great sages debate regarding the deity most worthy of their obeisance. They dispatch Bhrigu to the abodes of first Shiva, then Brahma, and finally Vishnu. Bhrigu finds that Shiva is occupied sporting with Parvati, Brahma is filled with the aspect of rajas, and Vishnu lays on Shesha, his feet rubbed by his consort, Lakshmi. When a furious Bhrigu kicks Vishnu on his chest, the latter greets the sage with warmth and considers himself to be blessed by the touch of his feet. Bhrigu hails Vishnu as the holder of the Sharanga as he sings his praises.In some versions of Krishna's battle with Narakasura, his second queen consort, Satyabhama, takes his bow to slay the asura"
    },
    {
        "name": "Origins Of River Ganga",
        "image": "../images/stories/Ganga.jpeg",
        "about":" Once, Shri Ram asked Guru Vishwamitra about the story of the origin of the Ganga River. Vishwamitra explained that Shri Ram's ancestor, King Sagara, performed the Ashwamedha Yajna. During this ritual, a horse traveled through all the kingdoms unhindered. When the horse entered the celestial kingdom of Indra, he stopped it and took it away. King Sagara then sent his six thousand sons to find the horse. When they couldn't find it on the earth, they started digging deep into the ground. Thousands of feet below, they encountered Kapil Rishi, who stopped them and disrupted their meditation. In anger, the sage burnt them all with his gaze. Sagara instructed his sons' remains to be immersed in the water, but there was no water available. They needed to bring the Ganga River from heaven to earth. Sagara couldn't accomplish this because the rapid flow of the Ganga could have submerged the entire earth. Years later, King Bhagirath undertook penance for Lord Shiva. Shiva stopped the Ganga in his locks and slowly released it from Gomukh. When Ganga touched the ashes of King Sagara's sons, they attained salvation. That's why even today, ashes are immersed in the Ganga. Finally, Ganga fell into the pit dug by King Sagara's sons and transformed into the ocean. The ocean was named Sagara after King Sagara. This is how the efforts and penance of Shri Ram's ancestor, Bhagirath, brought the compassionate and liberating river Ganga from heaven to various parts of the country, including the Himalayas, and made it a life-giving and salvation-bestowing river."
    },
    {
        "name":"Defeat of Rakshasa Tataka at the hands of Lord Rama",
        "image":"../images/stories/Tataka.jpeg",
        "about":"In the Rāmāyaṇa, Viśvāmitra tells Rāma and Lakṣmaṇa the story of Tāṭakā when they reach a forest inhabited by her. Viśvāmitra states that a yakṣa named Suketu had undertaken austerities to obtain children, and was given a daughter with the strength of a thousand elephants named Tāṭakā, but not a son. When she became of age, she was married to Sunda, and gave birth to a son named Mārīca. After Sunda is killed, Tāṭakā and Mārīca attack the seer Agastya, who curses Mārīca to become a rākṣasa and curses Tāṭakā to become an ugly man-eater. Driven mad by the curse, she roams the region where Agastya used to live.The Critical Edition of the Vālmīki Rāmāyaṇa does not mention many details of the previous narrative, but later commentators and recensions have more fleshed out versions of the story. According to three traditional commentaries on the Rāmāyaṇa, Sunda is killed due to a curse by Agastya, which Bhandare states gives proper cause for Tāṭakā's seemingly unwarranted attack on Agastya. The southern recensions of the epic state that Tāṭakā (prior to become a man-eater) tries to eat Agastya. An undated Malayālam script recension states that Taṭakā is smitten after seeing Agastya: stating that she proceeds to strip naked and run towards him singing with love. According to Goldman, this Malayālam script recension preserves an important part of the Tāṭakā legend that was suppressed in the Vālmīki Rāmāyaṇa.Viśvāmitra, after narrating Tāṭakā's past, instructs Rāma that he must kill Tāṭakā, and he should not have any compassion for her or disgust for killing a woman, and he recounts other occasions where unrighteous women were killed by moral men. Rāma agrees, stating the killing of Tāṭakā is uttamam 'an eminently justifiable action'. He twangs his bowstring, which attracts Tāṭakā to the scene. Rāma then states that he will not kill her on account of she being a woman, but vows to merely cut off her ears and nose and disposses her of her strength and lair. Tāṭakā then charges Rāma, who proceeds to shoot and kill her with a single arrow to the chest.Only in the southern recensions is the vow of Rāma cutting off Tāṭakā's ears and nose mentioned, and Rāma actually fulfils his vow in those recensions. The northern recensions neither mention the vow or its fulfillment, which leads Goldman to believe that the verses mentioning it are dubious."
    }
  ]